Show / Hide Table of Contents
Class GrpcService.GrpcServiceClient
Client for GrpcService
Inheritance
System.Object
Grpc.Core.ClientBase
Grpc.Core.ClientBase<GrpcService.GrpcServiceClient>
GrpcService.GrpcServiceClient
Inherited Members
 Grpc.Core.ClientBase<IdeaStatiCa.Plugin.Grpc.GrpcService.GrpcServiceClient>.WithHost(System.String)
 Grpc.Core.ClientBase.CallInvoker
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class GrpcServiceClient : ClientBase<GrpcService.GrpcServiceClient>
Constructors
Improve this Doc   View Source
GrpcServiceClient()
Protected parameterless constructor to allow creation of test doubles.
Declaration
protected GrpcServiceClient()
Improve this Doc   View Source
GrpcServiceClient(CallInvoker)
Creates a new client for GrpcService that uses a custom CallInvoker.
Declaration
public GrpcServiceClient(CallInvoker callInvoker)
Parameters
 Type |  Name |  Description
 Grpc.Core.CallInvoker |  callInvoker
The callInvoker to use to make remote calls.
Improve this Doc   View Source
GrpcServiceClient(ClientBase.ClientBaseConfiguration)
Protected constructor to allow creation of configured clients.
Declaration
protected GrpcServiceClient(ClientBase.ClientBaseConfiguration configuration)
Parameters
 Type |  Name |  Description
 Grpc.Core.ClientBase.ClientBaseConfiguration |  configuration
The client configuration.
Improve this Doc   View Source
GrpcServiceClient(ChannelBase)
Creates a new client for GrpcService
Declaration
public GrpcServiceClient(ChannelBase channel)
Parameters
 Type |  Name |  Description
 Grpc.Core.ChannelBase |  channel
The channel to use to make remote calls.
Methods
Improve this Doc   View Source
ConnectAsync(CallOptions)
Declaration
public virtual AsyncDuplexStreamingCall<GrpcMessage, GrpcMessage> ConnectAsync(CallOptions options)
Parameters
 Type |  Name |  Description
 Grpc.Core.CallOptions |  options
Returns
 Type |  Description
 Grpc.Core.AsyncDuplexStreamingCall<GrpcMessage, GrpcMessage>
Improve this Doc   View Source
ConnectAsync(Metadata, Nullable<DateTime>, CancellationToken)
Declaration
public virtual AsyncDuplexStreamingCall<GrpcMessage, GrpcMessage> ConnectAsync(Metadata headers = null, DateTime? deadline = default(DateTime? ), CancellationToken cancellationToken = default(CancellationToken))
Parameters
 Type |  Name |  Description
 Grpc.Core.Metadata |  headers
 System.Nullable<System.DateTime> |  deadline
 System.Threading.CancellationToken |  cancellationToken
Returns
 Type |  Description
 Grpc.Core.AsyncDuplexStreamingCall<GrpcMessage, GrpcMessage>
Improve this Doc   View Source
NewInstance(ClientBase.ClientBaseConfiguration)
Creates a new instance of client from given ClientBaseConfiguration.
Declaration
protected override GrpcService.GrpcServiceClient NewInstance(ClientBase.ClientBaseConfiguration configuration)
Parameters
 Type |  Name |  Description
 Grpc.Core.ClientBase.ClientBaseConfiguration |  configuration
Returns
 Type |  Description
 GrpcService.GrpcServiceClient
Overrides
Grpc.Core.ClientBase<IdeaStatiCa.Plugin.Grpc.GrpcService.GrpcServiceClient>.NewInstance(Grpc.Core.ClientBase.ClientBaseConfiguration)
 Improve this Doc
 View Source